{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "474_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "474_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "474", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "474", "inbound_nodes": [[["474_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "317", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "317", "inbound_nodes": [[["474", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "477_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "477_pad", "inbound_nodes": [[["317", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "477", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "477", "inbound_nodes": [[["477_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "320", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "320", "inbound_nodes": [[["477", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "480", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "480", "inbound_nodes": [[["320", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "483", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "483", "inbound_nodes": [[["480", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "325", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "325", "inbound_nodes": [[["483", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "486_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "486_pad", "inbound_nodes": [[["325", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "486", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "486", "inbound_nodes": [[["486_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "328", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "328", "inbound_nodes": [[["486", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "489", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "489", "inbound_nodes": [[["328", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "492", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "492", "inbound_nodes": [[["489", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "333", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "333", "inbound_nodes": [[["492", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "495_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "495_pad", "inbound_nodes": [[["333", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "495", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "495", "inbound_nodes": [[["495_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "336", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "336", "inbound_nodes": [[["495", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "498", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "498", "inbound_nodes": [[["336", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "339", "trainable": true, "dtype": "float32"}, "name": "339", "inbound_nodes": [[["489", 0, 0, {}], ["498", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "501", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "501", "inbound_nodes": [[["339", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "342", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "342", "inbound_nodes": [[["501", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "504_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "504_pad", "inbound_nodes": [[["342", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "504", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "504", "inbound_nodes": [[["504_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "345", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "345", "inbound_nodes": [[["504", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "507", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "507", "inbound_nodes": [[["345", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "510", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "510", "inbound_nodes": [[["507", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "350", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "350", "inbound_nodes": [[["510", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "513_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "513_pad", "inbound_nodes": [[["350", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "513", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "513", "inbound_nodes": [[["513_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "353", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "353", "inbound_nodes": [[["513", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "516", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "516", "inbound_nodes": [[["353", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "356", "trainable": true, "dtype": "float32"}, "name": "356", "inbound_nodes": [[["507", 0, 0, {}], ["516", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "519", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "519", "inbound_nodes": [[["356", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "359", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "359", "inbound_nodes": [[["519", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "522_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "522_pad", "inbound_nodes": [[["359", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "522", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "522", "inbound_nodes": [[["522_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "362", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "362", "inbound_nodes": [[["522", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "525", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "525", "inbound_nodes": [[["362", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "365", "trainable": true, "dtype": "float32"}, "name": "365", "inbound_nodes": [[["356", 0, 0, {}], ["525", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "528", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "528", "inbound_nodes": [[["365", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "368", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "368", "inbound_nodes": [[["528", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "531_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "531_pad", "inbound_nodes": [[["368", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "531", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "531", "inbound_nodes": [[["531_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "371", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "371", "inbound_nodes": [[["531", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "534", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "534", "inbound_nodes": [[["371", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "537", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "537", "inbound_nodes": [[["534", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "376", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "376", "inbound_nodes": [[["537", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "540_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "540_pad", "inbound_nodes": [[["376", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "540", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "540", "inbound_nodes": [[["540_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "379", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "379", "inbound_nodes": [[["540", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "543", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "543", "inbound_nodes": [[["379", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "382", "trainable": true, "dtype": "float32"}, "name": "382", "inbound_nodes": [[["534", 0, 0, {}], ["543", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "546", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "546", "inbound_nodes": [[["382", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "385", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "385", "inbound_nodes": [[["546", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "549_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "549_pad", "inbound_nodes": [[["385", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "549", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "549", "inbound_nodes": [[["549_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "388", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "388", "inbound_nodes": [[["549", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "552", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "552", "inbound_nodes": [[["388", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "391", "trainable": true, "dtype": "float32"}, "name": "391", "inbound_nodes": [[["382", 0, 0, {}], ["552", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "555", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "555", "inbound_nodes": [[["391", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "394", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "394", "inbound_nodes": [[["555", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "558_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "558_pad", "inbound_nodes": [[["394", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "558", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "558", "inbound_nodes": [[["558_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "397", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "397", "inbound_nodes": [[["558", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "561", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "561", "inbound_nodes": [[["397", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "400", "trainable": true, "dtype": "float32"}, "name": "400", "inbound_nodes": [[["391", 0, 0, {}], ["561", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "564", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "564", "inbound_nodes": [[["400", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "403", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "403", "inbound_nodes": [[["564", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "567_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "567_pad", "inbound_nodes": [[["403", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "567", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "567", "inbound_nodes": [[["567_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "406", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "406", "inbound_nodes": [[["567", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "570", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "570", "inbound_nodes": [[["406", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "573", "trainable": true, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "573", "inbound_nodes": [[["570", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "411", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "411", "inbound_nodes": [[["573", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "576_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "576_pad", "inbound_nodes": [[["411", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "576", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "576", "inbound_nodes": [[["576_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "414", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "414", "inbound_nodes": [[["576", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "579", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "579", "inbound_nodes": [[["414", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "417", "trainable": true, "dtype": "float32"}, "name": "417", "inbound_nodes": [[["570", 0, 0, {}], ["579", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "582", "trainable": true, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "582", "inbound_nodes": [[["417", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "420", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "420", "inbound_nodes": [[["582", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "585_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "585_pad", "inbound_nodes": [[["420", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "585", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "585", "inbound_nodes": [[["585_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "423", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "423", "inbound_nodes": [[["585", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "588", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "588", "inbound_nodes": [[["423", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "426", "trainable": true, "dtype": "float32"}, "name": "426", "inbound_nodes": [[["417", 0, 0, {}], ["588", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "591", "trainable": true, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "591", "inbound_nodes": [[["426", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "429", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "429", "inbound_nodes": [[["591", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "594_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "594_pad", "inbound_nodes": [[["429", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "594", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "594", "inbound_nodes": [[["594_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "432", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "432", "inbound_nodes": [[["594", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "597", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "597", "inbound_nodes": [[["432", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "600", "trainable": true, "dtype": "float32", "filters": 960, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "600", "inbound_nodes": [[["597", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "437", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "437", "inbound_nodes": [[["600", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "603_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "603_pad", "inbound_nodes": [[["437", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "603", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "603", "inbound_nodes": [[["603_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "440", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "440", "inbound_nodes": [[["603", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "606", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "606", "inbound_nodes": [[["440", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "443", "trainable": true, "dtype": "float32"}, "name": "443", "inbound_nodes": [[["597", 0, 0, {}], ["606", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "609", "trainable": true, "dtype": "float32", "filters": 960, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "609", "inbound_nodes": [[["443", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "446", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "446", "inbound_nodes": [[["609", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "612_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "612_pad", "inbound_nodes": [[["446", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "612", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "612", "inbound_nodes": [[["612_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "449", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "449", "inbound_nodes": [[["612", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "615", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "615", "inbound_nodes": [[["449", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "452", "trainable": true, "dtype": "float32"}, "name": "452", "inbound_nodes": [[["443", 0, 0, {}], ["615", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "618", "trainable": true, "dtype": "float32", "filters": 960, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "618", "inbound_nodes": [[["452", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "455", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "455", "inbound_nodes": [[["618", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "621_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "621_pad", "inbound_nodes": [[["455", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "621", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "621", "inbound_nodes": [[["621_pad", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "458", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "458", "inbound_nodes": [[["621", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "624", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "624", "inbound_nodes": [[["458", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "627", "trainable": true, "dtype": "float32", "filters": 1280, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "627", "inbound_nodes": [[["624", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "463", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "463", "inbound_nodes": [[["627", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "464", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "464", "inbound_nodes": [[["463", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "464_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAMAAABTAAAAcxgAAABkAWQCbABtAX0BAQB8AWoCoAN8AKEBUwApA07pAAAA\nACkB2gVrZXJhcykE2gp0ZW5zb3JmbG93cgIAAADaB2JhY2tlbmTaC2V4cGFuZF9kaW1zKQLaAXhy\nAgAAAKkAcgcAAAD6XS9Vc2Vycy9hamFuaS9taW5pY29uZGEzL2VudnMvc2x0LXBpcC9saWIvcHl0\naG9uMy43L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "464_EXPAND1", "inbound_nodes": [[["464", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "464_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAMAAABTAAAAcxgAAABkAWQCbABtAX0BAQB8AWoCoAN8AKEBUwApA07pAAAA\nACkB2gVrZXJhcykE2gp0ZW5zb3JmbG93cgIAAADaB2JhY2tlbmTaC2V4cGFuZF9kaW1zKQLaAXhy\nAgAAAKkAcgcAAAD6XS9Vc2Vycy9hamFuaS9taW5pY29uZGEzL2VudnMvc2x0LXBpcC9saWIvcHl0\naG9uMy43L3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "464_EXPAND2", "inbound_nodes": [[["464_EXPAND1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "472", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "472", "inbound_nodes": [[["464_EXPAND2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_0", "inbound_nodes": [[["472", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "474/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "474/bias", "shape": [32], "dtype": "float32"}, {"name": "477/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "477/bias", "shape": [32], "dtype": "float32"}, {"name": "480/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "480/bias", "shape": [16], "dtype": "float32"}, {"name": "483/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "483/bias", "shape": [96], "dtype": "float32"}, {"name": "486/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "486/bias", "shape": [96], "dtype": "float32"}, {"name": "489/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "489/bias", "shape": [24], "dtype": "float32"}, {"name": "492/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "492/bias", "shape": [144], "dtype": "float32"}, {"name": "495/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "495/bias", "shape": [144], "dtype": "float32"}, {"name": "498/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "498/bias", "shape": [24], "dtype": "float32"}, {"name": "501/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "501/bias", "shape": [144], "dtype": "float32"}, {"name": "504/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "504/bias", "shape": [144], "dtype": "float32"}, {"name": "507/kernel", "shape": [1, 1, 144, 32], "dtype": "float32"}, {"name": "507/bias", "shape": [32], "dtype": "float32"}, {"name": "510/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "510/bias", "shape": [192], "dtype": "float32"}, {"name": "513/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "513/bias", "shape": [192], "dtype": "float32"}, {"name": "516/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "516/bias", "shape": [32], "dtype": "float32"}, {"name": "519/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "519/bias", "shape": [192], "dtype": "float32"}, {"name": "522/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "522/bias", "shape": [192], "dtype": "float32"}, {"name": "525/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "525/bias", "shape": [32], "dtype": "float32"}, {"name": "528/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "528/bias", "shape": [192], "dtype": "float32"}, {"name": "531/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "531/bias", 